<!-- terraform-plan-cloudflare-pr-8 -->
## 📝 Terraform Plan for `cloudflare` (PR #8)

<details>
<summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # cloudflare_dns_record.root_ishiori_net_CNAME will be destroyed
  # (because cloudflare_dns_record.root_ishiori_net_CNAME is not in configuration)
  - resource "cloudflare_dns_record" "root_ishiori_net_CNAME" {
      - content     = "msn.com" -> null
      - created_on  = "2025-06-09T16:17:27Z" -> null
      - id          = "99ee1d1f57c5b89d78b3ac9e8ccd045d" -> null
      - meta        = jsonencode({})
      - modified_on = "2025-06-09T16:17:27Z" -> null
      - name        = "ishiori.net" -> null
      - proxiable   = true -> null
      - proxied     = true -> null
      - settings    = {
          - flatten_cname = false -> null
        } -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "CNAME" -> null
      - zone_id     = "50fddfb079d84376a2ae3dfa74d96c2a" -> null
    }

  # cloudflare_page_rule.redirect_root_to_hello will be created
  + resource "cloudflare_page_rule" "redirect_root_to_hello" {
      + actions     = {
          + forwarding_url = {
              + status_code = 301
              + url         = "https://hello.ishiori.net/$1"
            }
        }
      + created_on  = (known after apply)
      + id          = (known after apply)
      + modified_on = (known after apply)
      + priority    = 1
      + status      = "disabled"
      + target      = "ishiori.net/*"
      + zone_id     = "50fddfb079d84376a2ae3dfa74d96c2a"
    }

  # cloudflare_zone.ishiori_net will be updated in-place
  ~ resource "cloudflare_zone" "ishiori_net" {
      ~ activated_on          = "2025-02-07T07:17:28Z" -> (known after apply)
      + cname_suffix          = (known after apply)
      ~ created_on            = "2025-02-07T07:08:13Z" -> (known after apply)
      ~ development_mode      = 0 -> (known after apply)
        id                    = "50fddfb079d84376a2ae3dfa74d96c2a"
      ~ meta                  = {
          + cdn_only                 = (known after apply)
          ~ custom_certificate_quota = 0 -> (known after apply)
          + dns_only                 = (known after apply)
          + foundation_dns           = (known after apply)
          ~ page_rule_quota          = 3 -> (known after apply)
          ~ phishing_detected        = false -> (known after apply)
          ~ step                     = 2 -> (known after apply)
        } -> (known after apply)
      ~ modified_on           = "2025-02-07T07:17:28Z" -> (known after apply)
        name                  = "ishiori.net"
      ~ name_servers          = [
          - "lynn.ns.cloudflare.com",
          - "wally.ns.cloudflare.com",
        ] -> (known after apply)
      + original_dnshost      = (known after apply)
      ~ original_name_servers = [
          - "ns-1245.awsdns-27.org",
          - "ns-1793.awsdns-32.co.uk",
          - "ns-360.awsdns-45.com",
          - "ns-741.awsdns-28.net",
        ] -> (known after apply)
      ~ original_registrar    = "cv. jogjacamp (id: 1478)" -> (known after apply)
      ~ owner                 = {
          + id   = (known after apply)
          + name = (known after apply)
          ~ type = "user" -> (known after apply)
        } -> (known after apply)
      ~ permissions           = [
          - "#dns_records:edit",
          - "#dns_records:read",
          - "#zone:read",
        ] -> (known after apply)
      ~ plan                  = {
          ~ can_subscribe      = false -> (known after apply)
          ~ currency           = "USD" -> (known after apply)
          ~ externally_managed = false -> (known after apply)
          + frequency          = (known after apply)
          ~ id                 = "0feeeeeeeeeeeeeeeeeeeeeeeeeeeeee" -> (known after apply)
          ~ is_subscribed      = false -> (known after apply)
          ~ legacy_discount    = false -> (known after apply)
          ~ legacy_id          = "free" -> (known after apply)
          ~ name               = "Free Website" -> (known after apply)
          ~ price              = 0 -> (known after apply)
        } -> (known after apply)
      ~ status                = "active" -> (known after apply)
      ~ tenant                = {
          + id   = (known after apply)
          + name = (known after apply)
        } -> (known after apply)
      ~ tenant_unit           = {
          + id = (known after apply)
        } -> (known after apply)
      - vanity_name_servers   = [] -> null
      + verification_key      = (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>

*Workflow run: [`17191282230`](https://github.com/reverseon/ishiori-on-cloud/actions/runs/17191282230)*
